it/src/Catalogs/ОсновныеСредства/ОсновныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсновногоСредства</name>
    <type>
      <types>CatalogRef.ВидыОсновногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/AccumulationRegisters/ЛицензииОрганизации/ЛицензииОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛицензииОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/Catalogs/ОсновныеСредства/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	
	
	Если Параметры.Свойство("Организация") И Параметры.Отбор.Свойство("ИдентификаторПрограммы") Тогда
	
		СтандартнаяОбработка = Ложь;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СправочникОсновныеСредства.Ссылка КАК Лицензия,
		|	СправочникОсновныеСредства.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
		|	ЛицензииОрганизацииОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	Справочник.ОсновныеСредства КАК СправочникОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЛицензииОрганизации.Остатки(, Организация = &Организация) КАК ЛицензииОрганизацииОстатки
		|		ПО СправочникОсновныеСредства.ИдентификаторПрограммы = ЛицензииОрганизацииОстатки.ИдентификаторПрограммы
		|			И СправочникОсновныеСредства.Ссылка = ЛицензииОрганизацииОстатки.Лицензия
		|ГДЕ
		|	СправочникОсновныеСредства.ВидОсновногоСредства = ЗНАЧЕНИЕ(Справочник.ВидыОсновногоСредства.Лицензия)
		|	И НЕ ЛицензииОрганизацииОстатки.КоличествоОстаток ЕСТЬ NULL 
		|	И НЕ СправочникОсновныеСредства.ЭтоГруппа
		|	И СправочникОсновныеСредства.ИдентификаторПрограммы В(&СписокИдентификаторов)
		|	И СправочникОсновныеСредства.Наименование ПОДОБНО &СтрокаПоиска";
		
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("СписокИдентификаторов", УправлениеОсновнымиСредствамиСервер.ВернутьИдентификаторыАналогаНаСервере(Параметры.Отбор.ИдентификаторПрограммы));
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Список = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			
			Список.Добавить(Выборка.Лицензия);	
			
		КонецЦикла; 
		
		ДанныеВыбора = Список;
	
	КонецЕсли; 
	
	
КонецПроцедуры //ОбработкаПолученияДанныхВыбора
